{
    "@context": "https://w3id.org/everse/rsqd#",
    "@id": "https://w3id.org/everse/i/dimensions/interaction_capability",
    "@type": "SoftwareQualityDimension",
    "name": "Interaction Capability",
    "abbreviation": "interaction_capability",
    "identifier":"https://w3id.org/everse/i/dimensions/interaction_capability",
    "description": "Degree to which a product or system can be interacted with by specified users to exchange information via the user interface to complete specific tasks in a variety of contexts of use. This characteristic is composed of the following sub-characteristics:\n\n**Appropriateness recognizability**\n\nDegree to which users can recognize whether a product or system is appropriate for their needs.\n\n**Learnability**\n\nDegree to which the functions of a product or system can be learnt to be used by specified users within a specified amount of time.\n\n**Operability**\n\nDegree to which a product or system has attributes that make it easy to operate and control.\n\n**User error protection**\n\nDegree to which a system prevents users against operation errors.\n\n**User engagement**\n\nDegree to which a user interface presents functions and information in an inviting and motivating manner encouraging continued interaction.\n\n**Inclusivity**\n\nDegree to which a product or system can be used by people of various backgrounds (such as people of various ages, abilities, cultures, ethnicities, languages, genders, economic situations, etc.).\n\n**User assistance**\n\nDegree to which a product can be used by people with the widest range of characteristics and capabilities to achieve specified goals in a specified context of use.\n\n**Self-descriptiveness**\n\nDegree to which a product presents appropriate information, where needed by the user, to make its capabilities and use immediately obvious to the user without excessive interactions with a product or other resources (such as user documentation, help desks or other users).",
    "source": {
      "name": "ISO/IEC 25010 standard",
      "url": "https://iso25000.com/index.php/en/iso-25000-standards/iso-25010"
      }
  }